Tekla.Structures.AnalysisInternal.DotAnalysisBar.analysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.analysisType
The analysis type of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.cardinalPoint
The cardinal point of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.material
The material of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.profileNameStart
The name of the profile at the start.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.profileNameEnd
The name of the profile at the end.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.curvature
The curvature of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.composite
The composite beam of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.label
The label of the analysis bar.

Tekla.Structures.AnalysisInternal.DotAnalysisBar.analysisDesignCode
The analysis design code.